// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VolStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell vol command 
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_VOL_NOT_MAPPED             #language eng  "%hs: '%hs' is not mapped\n"	

#string STR_VOL_FILE_SYSTEM            #language eng  "%hs: '%hs' is not a file system\n"

#string STR_VOL_INVALID_VOLUME_LABEL   #language eng  "%hs: Invalid volume label %hs\n"

#string STR_VOL_VOLUME_LABEL_TOO_LONG  #language eng  "%hs: Volume label %hs is too long. Maximum is 11 characters\n"

#string STR_VOL_CANNOT_GET_CUR_DIR     #language eng  "%hs: Cannot get current directory\n"

#string STR_VOL_CANNOT_OPEN_VOLUME     #language eng  "%hs: Cannot open the volume %hs\n"

#string STR_VOL_CANNOT_GET_VOLUME_INFO #language eng  "%hs: Cannot get volume information of %hs\n"

#string STR_VOL_CANNOT_SET_VOLUME_INFO #language eng  "%hs: Cannot set volume information for %hs\n"

#string STR_VOL_CANNOT_VERIFY_INFO     #language eng  "%hs: Cannot verify volume information for %hs\n"

#string STR_VOL_NO_LABEL               #language eng  "Volume has no label"

#string STR_VOL_ONE_VAR                #language eng  "Volume %hs"

#string STR_VOL_BYTES_TOTAL            #language eng  "  %13,ld bytes total disk space\n"

#string STR_VOL_BYTES_AVAILABLE        #language eng  "  %13,ld bytes available on disk\n"	

#string STR_VOL_BYTES_IN_EACH          #language eng  "  %13,d bytes in each allocation unit\n"

#string STR_VOL_LINE_HELP              #language eng  "Displays volume information of the file system"

#string STR_VOL_VERBOSE_HELP           #language eng  "Displays volume information for the file system specified by fs.\n"
                                                      "\n"
                                                      "VOL [fs] [-n <Volume Label> | -d]\n"
                                                      "\n"
                                                      "    fs             - The name of the file system\n"
                                                      "    Volume Label   - New volume label\n"
                                                      "    -d             - Empty volume label\n"
                                                      "\n"
                                                      "    Notes:    1. The following characters cannot be used in Volume Label:\n"
                                                      "                 %% ^ * + = [ ] | : ; \" < > ? / ..\n"
                                                      "              2. No space is allowed in Volume Label.\n"
                                                      "              3. If fs is not specified, the current file system will be\n"
                                                      "                 taken as fs.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the volume of the current fs:\n"
                                                      "    fs0:\\> vol\n"
                                                      "    Volume has no label (rw)\n"
                                                      "          1,457,664 bytes total disk space\n"
                                                      "          1,149,440 bytes available on disk\n"
                                                      "                512 bytes in each allocation unit\n"
                                                      "\n"
                                                      "  * To change the label of fs0:\\\n"
                                                      "    shell> vol fs0 -n help_test\n"
                                                      "    Volume HELP_TEST (rw)\n"
                                                      "          1,457,664 bytes total disk space\n"
                                                      "          1,149,440 bytes available on disk\n"
                                                      "                512 bytes in each allocation unit\n"
                                                      "\n"
                                                      "  * To get rid of the label of fs0:\\\n"
                                                      "    fs0:\\> vol fs0 -d\n"
                                                      "    Volume has no label (rw)\n"
                                                      "          1,457,664 bytes total disk space\n"
                                                      "            220,160 bytes available on disk\n"
                                                      "                512 bytes in each allocation unit\n"
